### Forest: Sync Check Service Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
14:19:54.150 STDOUT terraform: data.external.sources_tar: Reading...
14:19:54.163 STDOUT terraform: data.external.sources_tar: Read complete after 0s [id=-]
14:19:54.166 STDOUT terraform: data.local_file.sources: Reading...
14:19:54.169 STDOUT terraform: data.digitalocean_project.forest_project: Reading...
14:19:54.169 STDOUT terraform: data.digitalocean_ssh_keys.keys: Reading...
14:19:54.170 STDOUT terraform: data.local_file.sources: Read complete after 0s [id=1433a123e3a493741dc8b23ea3d3a1113bccfd71]
14:19:54.460 STDOUT terraform: data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/17864415940875832378]
14:19:54.464 STDOUT terraform: digitalocean_droplet.forest: Refreshing state... [id=503863489]
14:19:55.504 STDOUT terraform: data.digitalocean_project.forest_project: Read complete after 2s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
14:19:55.505 STDOUT terraform: digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
14:19:56.970 STDOUT terraform: Terraform used the selected providers to generate the following execution
14:19:56.970 STDOUT terraform: plan. Resource actions are indicated with the following symbols:
14:19:56.970 STDOUT terraform:   ~ update in-place
14:19:56.971 STDOUT terraform: -/+ destroy and then create replacement
14:19:56.971 STDOUT terraform: Terraform will perform the following actions:
14:19:56.971 STDOUT terraform:   # digitalocean_droplet.forest must be replaced
14:19:56.971 STDOUT terraform: -/+ resource "digitalocean_droplet" "forest" {
14:19:56.971 STDOUT terraform:       ~ created_at           = "2025-06-23T10:47:57Z" -> (known after apply)
14:19:56.971 STDOUT terraform:       ~ disk                 = 320 -> (known after apply)
14:19:56.971 STDOUT terraform:       ~ id                   = "503863489" -> (known after apply)
14:19:56.971 STDOUT terraform:       ~ ipv4_address         = "207.154.209.95" -> (known after apply)
14:19:56.971 STDOUT terraform:       ~ ipv4_address_private = "10.135.0.18" -> (known after apply)
14:19:56.971 STDOUT terraform:       + ipv6_address         = (known after apply)
14:19:56.971 STDOUT terraform:       ~ locked               = false -> (known after apply)
14:19:56.971 STDOUT terraform:       ~ memory               = 16384 -> (known after apply)
14:19:56.971 STDOUT terraform:         name                 = "prod-sync-check"
14:19:56.971 STDOUT terraform:       ~ price_hourly         = 0.14286 -> (known after apply)
14:19:56.971 STDOUT terraform:       ~ price_monthly        = 96 -> (known after apply)
14:19:56.971 STDOUT terraform:       ~ private_networking   = true -> (known after apply)
14:19:56.971 STDOUT terraform:       ~ status               = "active" -> (known after apply)
14:19:56.971 STDOUT terraform:         tags                 = [
14:19:56.971 STDOUT terraform:             "iac",
14:19:56.971 STDOUT terraform:             "prod",
14:19:56.971 STDOUT terraform:         ]
14:19:56.971 STDOUT terraform:       ~ urn                  = "do:droplet:503863489" -> (known after apply)
14:19:56.972 STDOUT terraform:       ~ user_data            = (sensitive value) # forces replacement
14:19:56.972 STDOUT terraform:       ~ vcpus                = 8 -> (known after apply)
14:19:56.972 STDOUT terraform:       ~ volume_ids           = [] -> (known after apply)
14:19:56.972 STDOUT terraform:       ~ vpc_uuid             = "46a525ac-fd37-47ea-bb10-95c1db0055f7" -> (known after apply)
14:19:56.972 STDOUT terraform:         # (9 unchanged attributes hidden)
14:19:56.972 STDOUT terraform:     }
14:19:56.972 STDOUT terraform:   # digitalocean_project_resources.connect_forest_project will be updated in-place
14:19:56.972 STDOUT terraform:   ~ resource "digitalocean_project_resources" "connect_forest_project" {
14:19:56.972 STDOUT terraform:         id        = "da5e6601-7fd9-4d02-951e-390f7feb3411"
14:19:56.972 STDOUT terraform:       ~ resources = [
14:19:56.972 STDOUT terraform:           - "do:droplet:503863489",
14:19:56.972 STDOUT terraform:         ] -> (known after apply)
14:19:56.972 STDOUT terraform:         # (1 unchanged attribute hidden)
14:19:56.972 STDOUT terraform:     }
14:19:56.972 STDOUT terraform: Plan: 1 to add, 1 to change, 1 to destroy.
14:19:56.972 STDOUT terraform: Changes to Outputs:
14:19:56.972 STDOUT terraform:   ~ ip = [
14:19:56.972 STDOUT terraform:       ~ "207.154.209.95" -> (known after apply),
14:19:56.972 STDOUT terraform:     ]
14:19:56.972 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
14:19:56.973 STDOUT terraform: Saved the plan to: ../../../../../../tfplan
14:19:56.973 STDOUT terraform: To perform exactly these actions, run the following command to apply:
14:19:56.973 STDOUT terraform:     terraform apply "../../../../../../tfplan"
```

</details>